{
  "Grade 8 — Maths_q7|300 - 80 = 220 choclate. Each class get 10.": 0,
  "Grade 8 — Maths_q7|300 - 80 = 220 choclate. 8 class is there so 10 choclate.": 0,
  "Grade 8 — Maths_q7|300 - 80 = 220 choclate. 8 class is there so 80 divide 8 = 10 student. Each class get 10.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxigen. we shud save trees and animals for future. it is good for nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxigen and medicin. it save the trees and animals. we must save it for future.": 1,
  "Grade 8 — Social Science_q5|it is very importent for us. biodiversty means many plants and animals. we need them for food and oxigen. if they die we also die. it is good for nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxygen. it save the trees and animals. we must save it for future.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxigen and medisin. we must save trees and animals for future. it help in helthy enviroment.": 1,
  "Grade 8 — Social Science_q5|it is good for nature and trees. we get medisin and food from forest. save animals.": 0,
  "Grade 8 — Social Science_q5|it is help to save tree and animal for futcher. it is good for nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxigen and tree. we must save animals and plants for futcher.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. animal and plant help to live. if we save tree then we get oxigen and rain. it is good for futre.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. biodivarsity give us food and oxigen and tree. if animals die we also die. it is good for devlopment.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxigen. we shud save trees and animals for futur.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and wood and oxigen. we must save trees and animals for future. it is good for nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity means many plants and animals. it is good for forest and help us to get food and water. it is very importent for life.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us. it give us food and oxygen. it save the trees and animals. we need it for live.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. biodiversity means many plants and animals. we need them for food and oxigen. if they die we also die. it save our earth.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. biodiversity give us food and oxigen. if animals die we also die. it save the earth.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. biodiversity means many plants and animals. we need them for food and oxigen. if they die we also die. so we save them for future.": 0,
  "Grade 8 — Social Science_q5|it is very importent for us. animal and plant help to save the earth. if we not save then we will die. it is good for nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very importent for us because it give us food and oxigen. it help to save the earth and trees and animals. without this we canot live. it is good for devlopment.": 0,
  "Grade 7 — English_q15|My fevret hoby is playing cricket. I am play in evening with frends. I like bat and ball. It is very good game. I am happy.": 0,
  "Grade 7 — English_q15|My fevret hobby is playing cricket. I play with my frends in evening. I like batting. It is very happy for me. I love cricket.": 1,
  "Grade 7 — English_q15|My fevret hobby is play cricket. I am play in evening with my frends. I like bat and ball. It is very good game. I am happy.": 1,
  "Grade 7 — English_q15|My fevret hobby is playing cricket. I play with my frends in evening. I like cricket very much. It is good game. I am happy.": 0,
  "Grade 7 — English_q15|My fevret hoby is playing cricket. I am play in evening with frends. I like bat and ball. It is very happy. I am play every day.": 0,
  "Grade 7 — English_q15|My favret hoby is play cricket. I am play in evening with frends. It is very good game. I like batting. I am hapy to play.": 1,
  "Grade 7 — English_q15|My favret hoby is play cricket. I am play in evening with frends. It is very good game. I like batting. I am hapy.": 1,
  "Grade 7 — English_q15|My favret hoby is play cricket. I am play in evening with frends. It is very good game. I like batting. I am happy.": 0,
  "Grade 7 — English_q15|My fevret hobby is play cricket. I am play in evening with frends. It is very good game. I like batting. I am happy.": 1,
  "Grade 7 — English_q15|My fevret hoby is playing cricket. I am play in evening with frends. It is very good game. I like batting. I am happy.": 0,
  "Grade 7 — English_q15|My fevret hoby is playing cricket. I am play in evening with my frends. I like cricket becos it is good game. I am hapy.": 1,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. \nEach box 10.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box. 112 - 10 = 102. Ans is 102.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box. 112 - 10 = 102. Each box 10.": 0,
  "Grade 6 — Maths_q12|Total pensil = 112\nbox = 10\n112 - 10 = 102\nEach box = 102 pencils. \nNeed 8 more.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. \nEach box 10. \n112 - 10 = 102.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. box is 10. 112 - 10 = 102.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box. 112 - 10 = 102.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils total. 10 box is there. 112 - 10 = 102. Ans is 102.": 0,
  "Grade 6 — Maths_q12|112 - 10 = 102 pensil. 10 box. 102 is ans.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box. 112 is big number. Ans is 12.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. 10 box. 112.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils. box is 10. ans is 122.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare by chef.\nB. The king found successor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare by chef.\nB. The king found the successor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare.\nB. The king is finded the successor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare.\nB. King finded the sucessor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare by chef.\nB. King has finded the true succesor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare by chef.\nB. King has finded the successor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepare.\nB. The king found the successor.": 0,
  "Grade 8 — English_q6|fable is a story of animals. it give moral.": 1,
  "Grade 8 — English_q6|fable is a story of animals and it give moral.": 1,
  "Grade 8 — English_q6|febal is a story of animals. it give moral.": 1,
  "Grade 8 — English_q6|febal is a story of animals and moral.": 1,
  "Grade 8 — English_q6|febal is a story of animals and it give moral.": 1,
  "Grade 6 — Science_q9|(a) they protect our body from falling sick. (b) Vitamin - Night blindnes, Mineral - Goiter.": 1,
  "Grade 6 — Science_q9|(a) they help us to be strong and not fall sick. (b) Vitamin - Night blindnes. Mineral - goitre.": 1,
  "Grade 6 — Science_q9|(a) they protect our body from falling sick and keep us helty. (b) Vitamin - Night blindnes, Mineral - Goiter.": 1,
  "Grade 6 — Science_q9|(a) they help us to be strong and not fall sick. (b) vitamin - night blindnes, mineral - goiter.": 1,
  "Grade 6 — Science_q9|(a) they protect our body from falling sick and germs. (b) Vitamin - Night blindnes, Mineral - goiter.": 1,
  "Grade 6 — Science_q9|(a) they help to keep body fit and strong. (b) Vitamin - Night blindnes, Mineral - Goiter.": 0,
  "Grade 6 — Science_q9|(a) they help to keep body fit and strong. (b) Vitamin - Night blindnes, Minral - Goiter.": 0,
  "Grade 6 — Science_q9|(a) they protect us from bad things and keep body fit. (b) Vitamin - Night blindnes. Mineral - goiter.": 1,
  "Grade 6 — Science_q9|(a) they help us to be strong and not fall sick. (b) Vitamin - Night blindnes. Mineral - goiter.": 1,
  "Grade 6 — Science_q9|(a) they protect us from bad things and help body. (b) Vitamin - Night blindnes. Mineral - goiter.": 1,
  "Grade 6 — Science_q9|(a) they protect us from bad things. (b) vitamin - night blindnes, mineral - goiter.": 0,
  "Grade 6 — Science_q9|(a) they protect us from bad things and help body. (b) Vitamin - night blindnes. Mineral - goitre.": 1,
  "Grade 6 — English_q11|football are playin": 0,
  "Grade 6 — English_q11|playing futball": 0,
  "Grade 6 — English_q11|playing footbal": 0,
  "Grade 6 — English_q11|football are playing": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to run (c) coper becaus it is good.": 0,
  "Grade 8 — Science_q11|(a) iron  (b) because train is heavy and track will brake. (c) iron because it is very strong.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to go. (c) copper becuse it is good.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to run (c) copper becuse it is good.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to run (c) copper becaus it is good.": 0,
  "Grade 8 — Science_q11|(a) gas (b) because train is very heavy and it will brake. (c) iron because it is very strong.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to run (c) iron becoz it is very strong and hard.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to go (c) copper becouse it is good.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to go (c) coper becuse it is good.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to run properly (c) copper becuse it is good.": 0,
  "Grade 8 — Science_q11|(a) gas (b) becuse it is hot and rail will brake. (c) iron becuse it is strong.": 0,
  "Grade 8 — Science_q11|(a) iron (b) for train to go. (c) copper becouse it is good.": 0,
  "Grade 6 — English_q15|My best frend is Rahul. He is play cricket.": 0,
  "Grade 6 — English_q15|My best frand is Rahul. He is play cricket.": 0,
  "Grade 6 — English_q15|my best frand is Rahul. he is good boy.": 0,
  "Grade 8 — Science_q3|it is caled melability. metals are soft to beat.": 1,
  "Grade 8 — Science_q3|it is call mabilty. metals are very strong.": 0,
  "Grade 8 — Science_q3|it is call mabilty. metals are strong.": 0,
  "Grade 8 — Science_q3|it is caled melability. metals are soft.": 1,
  "Grade 8 — Science_q3|it is call malebility. metals are very strong.": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big. Many birds living in the tree. My grandfather say it is 100 year old. Childrens playing under the tree in evening. I like tree.": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big branches. My grandfather say it is 100 year old. Childrens are playing under the tree in evening. It give cool shadow and green leafs. W": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and big branch. My grand father say it is 100 year old. Many childern play under tree. It give cool shadow in sumer. We love tree.": 1,
  "Grade 8 — English_q11|My vilage tree is big. It is very old tree. My grand father play there. It have many green leaf and big branch. All people sit under tree in hot sun. I like tree.": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and big. Many birds living in tree. My grandfather say it is 100 year old. Childrens playing under tree in evening. I like tree.": 0,
  "Grade 8 — English_q11|My village have big banyan tree. It is very old and big. Many birds living in tree. My grandfather say it is 100 year old. Childrens playing under tree in evening. I like tree very much. It give shado": 0,
  "Grade 8 — English_q11|My village have big banyan tree. It is very old and big. Many birds living in tree. My grandfather say it is 100 year old. Childrens playing under tree in summer. I like tree.": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and big branch. My grandfather play under tree when he small boy. Many birds live in tree. People do puja and sit in shadow. I like tree very much.": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big. Many birds living in the tree. My grandfather say it is 100 year old. Childrens playing under the tree in evening. I like this tree ver": 0,
  "Grade 8 — English_q11|My village have big tree. It is very old and big green leaf. My grand father play under tree when he is small boy. Tree give us shadow and cool air. All pepul sit under tree and talk. I like tree very": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and big. Many birds living in the tree. My grandfather say it is 100 year old. Childrens playing under the tree in afternoon. We like the tree very m": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and big branch. My grandfather play under tree when he small. Tree give cool shadow and many birds live. We do puja of tree in festival. I like tree ": 1,
  "Grade 8 — English_q11|My vilage have big banyan tree. It is very old and big branch. My grand father say it is 100 year old. Children play under tree in evening. It give cool shadow. I love tree.": 0,
  "Grade 8 — English_q11|My village have big tree. It is banyan tree. It is very old and big branch. My grand father play under tree. Many birds live in tree. We pray the tree. It is very green.": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big. Many birds living in tree. My grandfather say it is 100 year old. Childrens playing under tree in evening. I like tree.": 0,
  "Grade 8 — English_q11|My village have big tree. It is very old and big green leaf. My grand father play under tree. It is banyan tree. Many birds live in tree. I like tree.": 0,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big branches. My grandfater say it is 100 year old. Childrens are playing under the tree in evening. It give cool shadow and green leafs. We": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big. Many birds living in the tree. My grandfather say it is 100 years old. Childrens playing under the tree in evening. We like the tree ve": 1,
  "Grade 8 — English_q11|My vilage have one big banyan tree. It is very old and very big branches. My grand father say it is 100 years old. Childrens are playing under the tree in evening. It give cool shadow and many birds l": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I eat hot pakoda. I am not go to school in rain. I like rain becos it is very cool. I am happy.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I am eating hot pakoda. I am not go to school in rain. I like rain very much. It is very good.": 1,
  "Grade 6 — English_q16|My favret seson is raini seson. I like water. I am pley in rain with paper bot. I wear raincot. I eat hot pakoda. It is very hapy. I love rain.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I am eating hot pakoda. I am not go to school in rain. I like rain becos it is cool. I am happy.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pley in rain with paper bot. I eat hot pakoda and tea. My mother scold me for wet. I like rain becos it is cool. I am happy in rain.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain bcos water is coming. I play in water with paper bot. I am eating hot pakoda. I am not go to school in rain. I like very much.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pley in rain with paper bot. I eat hot pakoda and tea. I am not go to school. I like raini seson very much. It is very gud.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like raini day. I play in water with paper bot. I eat hot pakoda. I am not go to school in rain. I like rain becos it is cool. I ware raincot.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like raini day. I am pleying in water with paper bot. I eat hot pakoda. I am not go to school. I like rain becos it is cool. I wear raincot.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I eat hot pakoda and tea. I am not go to school in rain. I like rain becos it is cool. I am very happy.": 1,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I am eating hot pakoda and tea. I am not go to school in rain. I like rain becos it is very cool. I am happy.": 1,
  "Grade 6 — English_q16|My fevret seson is mango. I like rain. I am pley in water with paper bot. I eat mango and icecrem. It is very cold water. I am happy. I ware t-shirt. I love rain.": 0,
  "Grade 6 — English_q16|My favret seson is rain. I like rain water. I am pleying in water with paper bot. I am eating hot pakoda. I am not go to school in rain. I like rain becos it is very cool. I am happy.": 1,
  "Grade 6 — English_q16|My fevret seson is mango. I like rain. I am pleying in water. I eat mango and icecrem. I ware t-shirt. I am hapy in rain. It is gud.": 0,
  "Grade 6 — English_q16|My fevret seson is mango. I like rain. I am play in water with paper bot. I am eating mango and icecrem. It is very hot so I am go to nani house. I am waring t-shirt. I like raini seson very much. My ": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 4 hour\n2 + 2 + 2 + 2 = 8\n30 + 8 = 38 C degree": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 4 hour\n2 + 2 + 2 + 2 = 8\n30 + 8 = 38 degree C.": 0,
  "Grade 6 — Maths_q7|10 am + 4 pm = 14. 30 + 2 = 32 degree C.": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 4 hour\n2 + 2 + 2 + 2 = 8\n30 + 8 = 38 degree C": 0,
  "Grade 6 — Maths_q7|30 + 2 = 32 degree C": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 4 hours. 30 + 2 = 32 degree. Ans: 32 C": 0,
  "Grade 6 — Maths_q7|10 am + 4 pm = 14. 30 + 2 = 32 degree. Ans is 32 C.": 0,
  "Grade 8 — Science_q6|(a) this is sun and dry land. (b) no water for drink and plant will die. it is drout.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) No water for drink and plant will die. No rain.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) no water for drinking and plants will die. No rain.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) no water for drink and plant will die. farmers are sad.": 0,
  "Grade 8 — Science_q6|(a) this is sun and dry land. (b) no water for drink. animal will die. it is drout.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) no water for drink and plant will die. farmers will be sad.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) No water for drink and plant will die. No rain is coming.": 0,
  "Grade 8 — Science_q6|(a) this is a dry land. (b) no water for drinking and plants will die. farmer will be sad.": 0,
  "Grade 8 — Science_q6|(a) this is dry land. (b) no water for drink and plant will die. cow also die.": 0,
  "Grade 8 — Science_q6|(a) it is a dry land. (b) no water for drink and plant will die. farmer will be sad.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nperimitar = 15 + 8 + 15 + 8 = 46 cm.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nPerimeter = 15 + 8 + 15 + 8 = 46 cm.\nAns is 23 and 46.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nPerimeter = 15 + 8 + 15 + 8 = 46 cm.\nAns is 46.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nperimitar = 15 + 8 + 15 + 8 = 46 cm": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nPerimeter = 15 + 15 + 8 + 8 = 46 cm.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nPerimeter = 15 + 8 + 15 + 8 = 46 cm. \nAns is 23 and 46.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm\nPerimeter = 15 + 8 + 15 + 8 = 46 cm.\nAns is 23.": 0,
  "Grade 6 — Maths_q8|Area = 15 + 8 = 23 cm.\nperimitar = 15 + 15 + 8 + 8 = 46 cm.": 0,
  "Grade 8 — English_q12|boy and dog is playing with ball. they are happy. sun is shining. the dog run fastly.": 0,
  "Grade 8 — English_q12|boy is go to school. he is play with ball. dog is runing. he is happy.": 0,
  "Grade 8 — English_q12|boy is play with dog. dog is runing. they are hapy. boy name is ramu. the sun is big.": 0,
  "Grade 8 — English_q12|boy is go to school. he is play with ball. rain is coming. he is happy.": 0,
  "Grade 8 — English_q12|boy and dog is playing. ball is red. they are hapy. boy runing.": 0,
  "Grade 8 — English_q12|boy is play with dog. dog is runing. they are happy. the sun is big.": 0,
  "Grade 8 — English_q12|boy is go to school. he is play with ball. dog is runing. sun is big. he is happy.": 0,
  "Grade 8 — English_q12|boy is runing. he see a dog. dog is bark. boy is very scaring. he climb on the tree. dog is go. boy is happy.": 0,
  "Grade 8 — English_q12|boy is play with ball. dog is runing. they are happy. tree is big. green grass.": 0,
  "Grade 8 — English_q12|boy is runing. dog is bharking. he is fall down in the road. he is crying. help help.": 0,
  "Grade 8 — English_q12|boy is go to school. he have bag. rain is coming. he is runing fast. he is hapy.": 0,
  "Grade 8 — English_q12|boy is play with ball. dog is runing. they are happy. sky is blue. boy name is raju.": 0,
  "Grade 8 — English_q12|boy is play with ball. dog is runing. they are happy in the park. sun is big.": 0,
  "Grade 8 — English_q12|boy and dog is playing. ball is red. they are happy in garden. tree is big. boy runing.": 0,
  "Grade 8 — English_q12|boy and dog is playing. ball is red. they are happy in the park. tree is big. boy runing.": 0,
  "Grade 8 — English_q12|boy is go to school. he is happy. rain is coming. he have umbrela. he is play in water. school is finish.": 0,
  "Grade 8 — English_q12|boy is runing. the dog is bark. he is fall down. help help. he is crying. the end.": 0,
  "Grade 6 — English_q12|dawn": 0,
  "Grade 7 — Maths_q1|-7": 0,
  "Grade 7 — Maths_q1|- 7": 0,
  "Grade 8 — Social Science_q1|1. Right to fredom 2. Right to ekuality": 1,
  "Grade 8 — Social Science_q1|1. Right to fredom 2. Right to ekality": 1,
  "Grade 8 — Social Science_q1|1. Right to fredom  2. Right to eqality": 1,
  "Grade 8 — Social Science_q1|1. Right to eqality 2. Right to freedom of relijon.": 1,
  "Grade 8 — Maths_q7|300 + 80 = 380 choclate.": 0,
  "Grade 8 — Maths_q7|Total students = 80. To distribute equally, each student gets at least 3 chocolates (80 x 3 = 240). If we give 4 each, we need 320. So minimum chocolates required = 320. \nTotal classes = 8. Students p": 1,
  "Grade 8 — Maths_q7|80 students. 300/80. 3 chocolates each. 60 left. \nEach class gets 300/8 = 37.5.": 0,
  "Grade 8 — Maths_q7|80 x 4 = 320. We need 20 more chocolates. \nEach class has 10 students. 10 x 3 = 30 chocolates.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 3.75. \nEach class get 300 / 8 = 37.5 choclates.": 0,
  "Grade 8 — Maths_q7|80 students 8 class. 80 - 8 = 72.": 0,
  "Grade 8 — Maths_q7|To give equal chocolates, 80 x 4 = 320. So 320 chocolates are required.\nEach class has 80/8 = 10 students.\nEach class gets 320 / 8 = 40 chocolates.": 1,
  "Grade 8 — Maths_q7|300 choklate. 80 student. 300 - 80 = 220.": 0,
  "Grade 8 — Maths_q7|80 + 8 = 88.": 0,
  "Grade 8 — Maths_q7|For equal distribution, we need a multiple of 80. The next multiple after 300 is 80 x 4 = 320. \nMinimum chocolates = 320.\nNumber of students per class = 80 / 8 = 10.\nChocolates per class = 320 / 8 = 4": 1,
  "Grade 8 — Maths_q7|300/80 = 3.": 0,
  "Grade 8 — Maths_q7|80 students. 300 is not divide by 80. So 320 choclates.\n8 classes. 320 / 8 = 40. Each class get 40.": 1,
  "Grade 8 — Maths_q7|80 x 4 = 320. Minimum 320 chocolates needed.\n80 students / 8 classes = 10 students per class.\n10 x 4 = 40 chocolates for each class.": 1,
  "Grade 8 — Maths_q7|300 / 80. Remainder is 60. \nEach class gets 300 / 8 = 37 choclates.": 0,
  "Grade 8 — Maths_q7|Total students = 80. For equal distribution, we need 320 chocolates (4 per student).\nTotal classes = 8.\nChocolates per class = 320 / 8 = 40.": 1,
  "Grade 8 — Maths_q7|80 students need 320 chocolates to get 4 each. \nEach class has 10 students. \n10 students x 4 chocolates = 40 chocolates per class.": 1,
  "Grade 8 — Maths_q7|300 / 80 = 3 choclates each. \nEach class = 300 / 8 = 37.5.": 0,
  "Grade 8 — Maths_q7|80 * 4 = 320. \n320 / 8 = 40. Each class get 40.": 1,
  "Grade 8 — Maths_q7|Minimum chocolates = 320 (so everyone gets 4).\nStudents per class = 80 / 8 = 10.\nChocolates per class = 320 / 8 = 40.": 1,
  "Grade 8 — Social Science_q5|biodiversity is very good for us and plants.": 0,
  "Grade 8 — Social Science_q5|Biodiversity means many types of plants and animals. It is important for sustainable development because it keeps the food chain balanced and provides resources for future.": 0,
  "Grade 8 — Social Science_q5|It is important because different species help in maintaining the ecosystem. If we save biodiversity, we can use resources for long time without finishing them.": 0,
  "Grade 8 — Social Science_q5|Biodiversity gives us food, medicine and oxygen. We must save it for future.": 0,
  "Grade 8 — Social Science_q5|Biodiversity is essential for sustainable development as it ensures ecosystem stability. It provides ecological services like pollination, soil fertility, and water purification, which are necessary f": 1,
  "Grade 8 — Social Science_q5|It helps in maintaining the balance of nature. Sustainable development needs biodiversity so that natural resources do not get destroyed completely.": 0,
  "Grade 8 — Social Science_q5|Many plants and animals live together. This is biodiversity. It is important for our life and environment.": 0,
  "Grade 8 — Social Science_q5|[Left Blank]": 0,
  "Grade 8 — Social Science_q5|We get wood and fruits from trees. Biodiversity is important to save the earth from pollution.": 0,
  "Grade 8 — Social Science_q5|It means variety of life. It is important for sustainable development to protect the nature.": 0,
  "Grade 8 — Social Science_q5|biodiversity is forest. we should not cut trees.": 0,
  "Grade 8 — Social Science_q5|it is very importent for devlopment.": 0,
  "Grade 8 — Social Science_q5|Sustainable development is good for india. Biodiversity is many animals in zoo.": 0,
  "Grade 8 — Social Science_q5|Biodiversity provides the biological base for food security and health. For sustainable development, we must conserve variety of species to ensure that the ecosystem remains productive for future gene": 1,
  "Grade 8 — Social Science_q5|It helps to keep the environment clean and gives us many things to use.": 0,
  "Grade 8 — Social Science_q5|Biodiversity is the variety of life on earth. It is important for sustainable development because it provides raw materials and maintains the natural cycle of the planet.": 0,
  "Grade 8 — Social Science_q5|We need biodiversity for oxygen and rain. It is important for future people.": 1,
  "Grade 8 — Social Science_q5|save trees save life.": 0,
  "Grade 8 — Social Science_q5|Biodiversity means different types of living things. It is important for balance in nature and for our needs.": 0,
  "Grade 8 — Social Science_q5|Sustainable development means using resources carefully. Biodiversity helps this by providing different resources like food and medicine which are needed for human survival.": 0,
  "Grade 7 — English_q15|My hobby is playing cricket. I play with my friends in evening. It is very good game. I like batting. I am happy when I play.": 1,
  "Grade 7 — English_q15|My hobbi is play. I play every day. I like cricket.": 0,
  "Grade 7 — English_q15|My favourite hobby is drawing. I draw beautiful pictures of flowers and mountains in my free time. I use many colours. I feel very happy and relaxed when I draw. It is my best hobby.": 1,
  "Grade 7 — English_q15|I like reading books. I read story books at night. My mother give me books. It is very interesting. I learn new words.": 1,
  "Grade 7 — English_q15|My fvrite hobby is tv. I see tv. It is good.": 0,
  "Grade 7 — English_q15|My favourite hobby is dancing. I practice dance after my school finishes. I like to dance on Bollywood songs. It makes my body fit and I feel energetic.": 1,
  "Grade 7 — English_q15|My hobby is singing songs. I sing in morning. My teacher help me. I love music very much.": 1,
  "Grade 7 — English_q15|My favourite hobby is gardening. Every morning, I water the plants in my small backyard. I love watching the seeds grow into beautiful green plants and flowers. It makes me feel close to nature and gi": 1,
  "Grade 7 — English_q15|I like play footbal. Sunday I play.": 0,
  "Grade 7 — English_q15|My hobby is swimming. I go to the pond on Sundays. I swim with my brother. It is very fun and good for health.": 1,
  "Grade 7 — English_q15|My hoby is eating. I like mango.": 0,
  "Grade 7 — English_q15|My favourite hobby is playing football. I play on the school ground every evening with my friends. It is a very exciting game. I enjoy it because it makes me strong and fast.": 1,
  "Grade 7 — English_q15|My favourite hobby is listening to music. Whenever I am free, I put on my headphones and listen to songs. It helps me to forget my worries. Music makes me feel very calm and happy.": 1,
  "Grade 7 — English_q15|My favourite hobby is writing short stories. I usually write in my diary before going to bed at night. I enjoy creating new characters and imaginary worlds. Writing helps me express my feelings and im": 1,
  "Grade 7 — English_q15|I like to play kabaddi. We play in school ground. It is my favourite game. I like it because it is very strong game.": 0,
  "Grade 7 — English_q15|My favourite hobby is cooking with my mother. I help her in the kitchen on holidays. We make tasty snacks like pakoras. I enjoy it because I love to learn how to make food.": 1,
  "Grade 7 — English_q15|I like play. My hobby is play.": 0,
  "Grade 7 — English_q15|My hobby is cycling. I ride my cycle in the evening. I go to the park. It is very fun to ride fast with friends.": 1,
  "Grade 7 — English_q15|My favourite hobby is watching cartoons. I watch it after doing my homework. I like Tom and Jerry. It is very funny and I laugh a lot.": 1,
  "Grade 6 — Maths_q12|Total pencil = 112. Box = 10. 112 / 10 = 11. 2 pencil left. 8 more pencil needed. Each box 12 pencil.": 0,
  "Grade 6 — Maths_q12|Total pencils = 112. Boxes = 10. To make it equal, we need 120 pencils. So 120 - 112 = 8 pencils required. Each box will have 12 pencils.": 0,
  "Grade 6 — Maths_q12|112 pencils. 10 box. 112 + 8 = 120. 8 pencil needed. Each box 12.": 1,
  "Grade 6 — Maths_q12|No. of pencils = 112. No. of boxes = 10. For equal distribution, 112 / 10 gives remainder 2. Next multiple of 10 is 120. Pencils needed = 8. Pencils in each box = 12.": 1,
  "Grade 6 — Maths_q12|112 - 10 = 102 pencils.": 0,
  "Grade 6 — Maths_q12|112 divide by 10. 11 pencil in each box. 2 is left. 8 more pencils.": 1,
  "Grade 6 — Maths_q12|11210 pencils.": 0,
  "Grade 6 — Maths_q12|Total pencils = 112. Number of boxes = 10. To have an equal number of pencils in each box without any left over, the total must be divisible by 10. The next multiple of 10 after 112 is 120. \n1) Minimu": 1,
  "Grade 6 — Maths_q12|[Left Blank]": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122.": 0,
  "Grade 6 — Maths_q12|10 x 11 = 110. 10 x 12 = 120. We need 8 more pencils. Each box 12 pencils.": 1,
  "Grade 6 — Maths_q12|Given: 112 pencils, 10 boxes. \nTo find the minimum pencils to add: 10 - (112 mod 10) = 10 - 2 = 8 pencils.\nTotal pencils = 112 + 8 = 120.\nPencils per box = 120 / 10 = 12.\nAns: 8 pencils needed, 12 in ": 0,
  "Grade 6 — Maths_q12|112 pencils in 10 box. 112.": 0,
  "Grade 6 — Maths_q12|112 / 10. Remainder is 2. So 8 more pencils needed to make it 120. 12 pencils in each box.": 1,
  "Grade 6 — Maths_q12|10 boxes 112 pencils. 1120.": 0,
  "Grade 6 — Maths_q12|112 pencils and 10 boxes. 112 is not in 10 table. 120 is in 10 table. So 8 pencils more needed. Each box will have 12 pencils.": 1,
  "Grade 6 — Maths_q12|To put equal pencils in 10 boxes, total should be 120. \nExtra pencils needed = 120 - 112 = 8.\nPencils in each box = 12.": 0,
  "Grade 6 — Maths_q12|112 + 8 = 120. 8 pencils needed. 12 pencils in each box.": 0,
  "Grade 6 — Maths_q12|Total pencils = 112. Boxes = 10. \n112 / 10 = 11 pencils and 2 left. \nTo make it equal we need 12 in each. \n12 x 10 = 120. \n120 - 112 = 8 pencils required.": 1,
  "Grade 6 — Maths_q12|112 / 10 = 11.2. So 12 pencils. 8 pencils needed.": 0,
  "Grade 8 — English_q8|A. A delicious meal was prepared by the chef. B. The true successor was found by the king.": 1,
  "Grade 8 — English_q8|A. A delicious meal was prepared by the chef. B. The true successor has been found by the king.": 1,
  "Grade 8 — English_q8|A. A delicious meal prepared by chef. B. True successor found by king.": 0,
  "Grade 8 — English_q8|A. Delicious meal was prepare by chef. B. The true successor has found by king.": 0,
  "Grade 8 — English_q8|A. A delicious meal was prepared by chef. B. The true successor was found by king.": 0,
  "Grade 8 — English_q8|A. Chef is preparing meal. B. King found successor.": 0,
  "Grade 8 — English_q8|A. A delicious meal was prepared by the chef. B. The true successor has been find by the king.": 0,
  "Grade 8 — English_q8|A. The meal is delicious. B. King is successor.": 0,
  "Grade 8 — English_q8|A. A delicious meal was prepared by chef. B. The true successor is found by king.": 0,
  "Grade 8 — English_q8|[Left Blank]": 0,
  "Grade 8 — English_q8|A. Chef prepared meal. B. King has found.": 0,
  "Grade 8 — English_q8|A. The chef was prepared meal. B. The king has been found.": 0,
  "Grade 8 — English_q8|A. delicious meal. B. king successor.": 0,
  "Grade 8 — English_q6|A fable is a story of animals. It gives a moral.": 1,
  "Grade 8 — English_q6|Fable is a short story, tipically with animals as characters, conveying a moral lesson.": 1,
  "Grade 8 — English_q6|A fable is a short fictional story that features animals, mythical creatures, or plants as characters which are given human qualities to teach a moral lesson at the end.": 1,
  "Grade 8 — English_q6|A fable is a brief narrative, usually featuring animals that act like humans, intended to provide a moral or practical lesson to the reader.": 1,
  "Grade 8 — English_q6|Fable is story with animals and moral.": 1,
  "Grade 8 — English_q6|It is a story. In this animals talk like humans.": 0,
  "Grade 8 — English_q6|Fable means moral story of animals.": 1,
  "Grade 8 — English_q6|A fable is a story where animals are characters and it teaches us a good lesson.": 1,
  "Grade 8 — English_q6|fable is story.": 0,
  "Grade 8 — English_q6|A fable is a short story with animals as characters and it gives a moral.": 1,
  "Grade 8 — English_q6|Fable is a story that teaches us a lesson. Example: The Ant and the Cricket.": 0,
  "Grade 8 — English_q6|Animal story with moral lesson.": 1,
  "Grade 8 — English_q6|Fable is a story. Animals speak in this story.": 0,
  "Grade 8 — English_q6|febale is poem.": 0,
  "Grade 8 — English_q6|A fable is a traditional story that teaches a moral, usually with animals as the main characters.": 1,
  "Grade 8 — English_q6|It is a story about animals and birds.": 0,
  "Grade 8 — English_q6|table is story.": 0,
  "Grade 8 — English_q6|moral story.": 0,
  "Grade 6 — Science_q9|(a) They protect our body from diseases. (b) Vitamin - Night blindness, Mineral - Goitre.": 1,
  "Grade 6 — Science_q9|(a) it give us energy. (b) Vitamin A and Iron.": 0,
  "Grade 6 — Science_q9|(a) food is good for helth. (b) [blank]": 0,
  "Grade 6 — Science_q9|(a) protect food. (b) scurvy and calcium.": 0,
  "Grade 6 — Science_q9|(a) Because they protect us from falling sick. (b) Vitamin C - Scurvy, Mineral - Anemia.": 1,
  "Grade 6 — Science_q9|(a) we eat daily. (b) Beri beri.": 0,
  "Grade 6 — Science_q9|(a) Vitamins and minerals are called protective foods because they protect our body against diseases and keep us healthy. (b) Vitamin D - Rickets, Iodine - Goitre.": 1,
  "Grade 6 — Science_q9|(a) They are called protective foods because they help our body to fight against diseases. (b) Vitamin A: Night blindness, Iron: Anaemia.": 1,
  "Grade 6 — Science_q9|(a) It protect our body. (b) Vitamin B - Beriberi, Mineral - Goitre.": 1,
  "Grade 6 — Science_q9|(a) These are called protective foods because they provide protection against various diseases. (b) Vitamin C - Scurvy, Iron - Anemia.": 1,
  "Grade 6 — Science_q9|(a) They protect our eyes and bones. (b) Vitamin A and Iodine.": 0,
  "Grade 6 — Science_q9|(a) They are called protective foods because they protect our body from diseases and help in maintaining good health. (b) Vitamin B1 - Beri-beri, Calcium - Bone decay.": 1,
  "Grade 6 — Science_q9|(a) Vitamins and minerals protect our body from diseases, so they are called protective foods. (b) Vitamin C: Scurvy, Iodine: Goitre.": 1,
  "Grade 6 — Science_q9|(a) for helth. (b) vitamin and minral.": 0,
  "Grade 6 — Science_q9|(a) Vitamins and minerals are known as protective foods because they protect our body from various diseases and are required for the proper functioning of our body. (b) Deficiency of Vitamin A causes ": 1,
  "Grade 6 — Science_q9|(a) They protect us from disease. (b) Vitamin D - Rickets, Mineral - Iron.": 1,
  "Grade 6 — Science_q9|(a) food is protect. (b) [blank]": 0,
  "Grade 6 — Science_q9|(a) Because they protect our body. (b) Vitamin A - Night blindness, Iodine - Goitre.": 1,
  "Grade 6 — Science_q9|(a) They give protection from sickness. (b) Scurvy and Anemia.": 1,
  "Grade 6 — Science_q9|(a) Vitamins and minerals are called protective foods because they help our body to fight against disease-causing germs and keep our immune system strong. (b) Vitamin deficiency: Beri-beri (Vit B), Mi": 1,
  "Grade 6 — English_q11|playing": 0,
  "Grade 6 — English_q11|are playing": 1,
  "Grade 6 — English_q11|football": 0,
  "Grade 6 — English_q11|children": 0,
  "Grade 6 — English_q11|are playing football": 0,
  "Grade 6 — English_q11|The verb phrase is \"are playing\".": 1,
  "Grade 6 — English_q11|playing football": 0,
  "Grade 6 — English_q11|children are": 0,
  "Grade 6 — English_q11|childran": 0,
  "Grade 6 — English_q11|play": 0,
  "Grade 6 — English_q11|The children are playing football.": 0,
  "Grade 6 — English_q11|are playing (Verb Phrase)": 1,
  "Grade 8 — Science_q11|(a) Gas (b) Because of heat. (c) Copper because it is good.": 0,
  "Grade 8 — Science_q11|(a) According to the table, gases expand the most. (b) Gaps are left between railway tracks to allow for thermal expansion during summer. Without gaps, the tracks would bend or buckle. (c) Copper meta": 0,
  "Grade 8 — Science_q11|(a) Aluminium (b) For safety. (c) Iron wire because it is strong.": 1,
  "Grade 8 — Science_q11|(a) Gas expands most. (b) In summer tracks get hot and expand. If no gap is there, they will break. (c) Copper because it conducts electricity well.": 0,
  "Grade 8 — Science_q11|(a) Liquid (b) To stop accident. (c) Copper wire.": 0,
  "Grade 8 — Science_q11|(a) Gas. (b) Gaps are left because metals expand on heating. The gap gives space for expansion in summer. (c) Copper, because it has low resistance.": 0,
  "Grade 8 — Science_q11|(a) Iron (b) train will run (c) steel": 0,
  "Grade 8 — Science_q11|(a) water (b) [blank] (c) plastic": 0,
  "Grade 8 — Science_q11|(a) Gases show maximum expansion on heating. (b) Railway tracks are made of steel which expands when temperature rises. Gaps prevent the rails from warping or deforming. (c) Copper is recommended beca": 0,
  "Grade 8 — Science_q11|(a) Gas (b) Because it becomes hot in sun. (c) Copper is best.": 0,
  "Grade 8 — Science_q11|(a) Air (b) To save the track from bending. (c) Gold metal.": 0,
  "Grade 8 — Science_q11|(a) 100 (b) gap is for wheels (c) silver": 0,
  "Grade 8 — Science_q11|(a) Gas expands the most. (b) Metals expand when heated. Gaps are left so tracks don't bend in summer heat. (c) Copper because it is a good conductor of electricity.": 0,
  "Grade 8 — Science_q11|(a) Gas. (b) Due to thermal expansion, the tracks increase in length. Gaps provide space. (c) Copper metal because it allows current to flow easily.": 0,
  "Grade 8 — Science_q11|(a) Solid (b) [blank] (c) Iron": 0,
  "Grade 8 — Science_q11|(a) heating (b) for the train (c) wire": 0,
  "Grade 8 — Science_q11|(a) Gas (b) Because of expansion. (c) Copper because it is cheap and good.": 0,
  "Grade 8 — Science_q11|(a) Gases. (b) Gaps are left for expansion of the iron rails during hot weather. (c) Copper, because it is a very good conductor.": 0,
  "Grade 8 — Science_q11|(a) Gas (b) To prevent bending of tracks. (c) Copper.": 0,
  "Grade 8 — Science_q11|(a) Table (b) No answer (c) Copper metal.": 0,
  "Grade 6 — English_q15|My frend is Rahul. He is good.": 0,
  "Grade 6 — English_q15|My best friend name is Amit. He play cricket with me.": 0,
  "Grade 6 — English_q15|I have a best frend. Her name is Priya.": 0,
  "Grade 6 — English_q15|My best friend is Neha. She is very butiful.": 0,
  "Grade 6 — English_q15|My best friend is Rohan because he helps me in my studies. We always eat our lunch together during the break.": 1,
  "Grade 6 — English_q15|My best friend is Sneha. She is a very kind girl.": 1,
  "Grade 6 — English_q15|My frand is boy.": 0,
  "Grade 6 — English_q15|I like my friend. His name is Sonu.": 1,
  "Grade 6 — English_q15|My best friend is Anjali. She is my neighbor.": 1,
  "Grade 6 — English_q15|My friend name is Ravi. He is good boy.": 0,
  "Grade 6 — English_q15|My best friend's name is Aditya and he is very hardworking. He always shares his toys and books with me.": 1,
  "Grade 6 — English_q15|I love my frend.": 0,
  "Grade 6 — English_q15|My best friend is Pooja. She is very clever and she likes to draw pictures.": 1,
  "Grade 6 — English_q15|My best friend is Sahil. We go to school together every day.": 1,
  "Grade 6 — English_q15|Meena is my best friend. She helps me when I am sad.": 1,
  "Grade 6 — English_q15|My best frnd is [Scribble]": 0,
  "Grade 6 — English_q15|Rahul is my.": 0,
  "Grade 6 — English_q15|My best friend is Vikram. He is very tall.": 1,
  "Grade 6 — English_q15|My best friend is Kiran. She is the topper of our class.": 1,
  "Grade 8 — Science_q3|The property of metals to be beaten into thin sheets is called Malleability.": 1,
  "Grade 8 — Science_q3|It is called Maleability.": 1,
  "Grade 8 — Science_q3|Malleability is the property that allows metals to be beaten into thin sheets.": 1,
  "Grade 8 — Science_q3|This property is known as malleability. Because of this, metals like aluminium can be converted into thin foils without breaking.": 1,
  "Grade 8 — Science_q3|Malebility.": 0,
  "Grade 8 — Science_q3|malleablity": 1,
  "Grade 8 — Science_q3|It is called Maliability.": 1,
  "Grade 8 — Science_q3|Hardness of metal.": 0,
  "Grade 8 — Science_q3|aluminium foil is used for food.": 0,
  "Grade 8 — Science_q3|Ductility": 0,
  "Grade 8 — Science_q3|The property is Malleability.": 1,
  "Grade 8 — Science_q3|maleable": 1,
  "Grade 8 — Science_q3|Malleablity": 1,
  "Grade 8 — Science_q3|Malleability.": 1,
  "Grade 8 — Science_q3|beating metal": 0,
  "Grade 8 — Science_q3|Maleability": 1,
  "Grade 8 — Science_q3|The property of metals by which they can be beaten into thin sheets is called malleability. For example, silver and aluminium foils.": 1,
  "Grade 8 — Science_q3|Good conductor": 0,
  "Grade 8 — Science_q3|Malleability is the property of metals to make thin sheets.": 1,
  "Grade 8 — English_q11|There is a big Banyan tree in my village. It is very old and very tall. Many birds live in the tree. Children play under the tree in evening. It gives us cool shade. We love this tree very much.": 1,
  "Grade 8 — English_q11|My village tree is big. It is very old. Green leaf. I play.": 0,
  "Grade 8 — English_q11|The oldest tree in my town is a massive Peepal tree located near the temple. It has a thick, twisted trunk and its branches spread like a giant umbrella, providing shade to everyone. My grandfather sa": 1,
  "Grade 8 — English_q11|The old tree is very big. It is a Neem tree. It is near the well. My grandmother told it is very old tree. We sit under tree when it is hot. It is very helpfull for us.": 0,
  "Grade 8 — English_q11|In my village one big tree is there. It is banyan tree. It has many roots hanging down. We swing on the roots. It is very old tree from many years. All people sit there.": 0,
  "Grade 8 — English_q11|The oldest tree in my village is a huge Banyan tree. It looks very strong with many hanging roots and green leaves. My father told me that this tree is more than eighty years old. In the afternoon, th": 1,
  "Grade 8 — English_q11|My town has a old Mango tree. It is very big and give sweet fruits. Many people sit under the tree. It is very old tree. I like the tree.": 0,
  "Grade 8 — English_q11|The oldest tree is Banyan tree. It is very large. It is near the school. We play there every day. It is very old and green.": 0,
  "Grade 8 — English_q11|There is a old tree in my village. It is very big and tall. It has many branches. It is very old from my grandfather time. We like to sit under it.": 0,
  "Grade 8 — English_q11|There is a very old Peepal tree in the center of our village. Its trunk is very wide and the leaves always rustle in the wind. People say it was planted before our country got independence. Every morn": 1,
  "Grade 8 — English_q11|Tree is big. My village tree. It is old.": 0,
  "Grade 8 — English_q11|[Left Blank]": 0,
  "Grade 8 — English_q11|The oldest tree in my town is a giant Neem tree near the bus stand. It has a very rough bark and thousands of small leaves. This tree has been there for many generations, maybe a hundred years. People": 1,
  "Grade 8 — English_q11|My village has a big tree. It is very old. It is Banyan tree. Many monkeys stay on the tree. We play under the tree. It is very big.": 0,
  "Grade 8 — English_q11|Big tree in my vilage. Very old. I like.": 0,
  "Grade 8 — English_q11|In my village, the oldest tree is a Banyan tree near the pond. It looks like a small forest because of its many hanging roots. No one knows exactly how old it is, but even the oldest man in the villag": 1,
  "Grade 8 — English_q11|The oldest tree in my town is a Peepal tree that stands near the old gate. It is very tall and its leaves are heart-shaped. My teacher said it is nearly ninety years old. The community uses the space ": 1,
  "Grade 8 — English_q11|Tree is green. Very big old tree.": 0,
  "Grade 8 — English_q11|My village tree is banyan. It is very big. Old tree.": 0,
  "Grade 8 — English_q11|The oldest tree in my village is a majestic Banyan tree that has stood for over a century. Its massive trunk and sprawling branches create a vast canopy of shade that protects us from the scorching su": 1,
  "Grade 6 — English_q16|My favorite season is winter. It is very cold. I wear sweter and cap. I like to drink hot tea. I play in sun with my friends. I like winter because no sweting.": 1,
  "Grade 6 — English_q16|My favorite season is the Monsoon. I love it because the rain makes everything green and beautiful. When it rains, I like to make paper boats and float them in the water. My mother makes hot pakoras a": 1,
  "Grade 6 — English_q16|My favorit seson is sumer. It is hot. I drink water. I like mango.": 0,
  "Grade 6 — English_q16|[Left Blank]": 0,
  "Grade 6 — English_q16|I like summer season. I eat mango and ice cream. It is very hot so I wear cotton cloths. I go to mama house in hollyday. I like summer because no school.": 1,
  "Grade 6 — English_q16|My favorite season is winter. I like to eat gajar halwa. I wear woolen cloths and jacket. I play cricket in morning. It is very cold and I like sleeping in rajai.": 1,
  "Grade 6 — English_q16|My favorite season is Winter. In this season the weather is very cold. I wear sweaters, gloves and shoes to stay warm. I like to eat hot food and drink milk. I like winter because we can sit in the su": 1,
  "Grade 6 — English_q16|My favorite season is rainny season. I like rain. I wear raincoat. I eat pakoda. I like to play in water. It is very green.": 1,
  "Grade 6 — English_q16|My favorite season is Summer. Although it is very hot, I like it because we get summer holidays. I love eating mangoes and drinking cold juice. I wear light cotton clothes. I spend time with my cousin": 1,
  "Grade 6 — English_q16|I like rain. I play in water. My mother scold me.": 0,
  "Grade 6 — English_q16|My favorite season is winter. It is very cold in December. I wear red sweter. I eat peanuts and sweets. I like winter because I dont feel thursty.": 1,
  "Grade 6 — English_q16|I like Monsoon season. Rain is coming and trees are green. I use umbrella. I eat hot snacks. I like rain because it is cool.": 1,
  "Grade 6 — English_q16|My favorite season is Winter. I like this season because the weather is not hot. I wear warm clothes like jackets and mufflers. I like to eat hot soup and seasonal fruits. I play football with my frie": 1,
  "Grade 6 — English_q16|My favorite season is the Rainy season. I love the smell of the earth when it rains. I wear a raincoat and boots to go to school. My mother makes tasty snacks like samosas. I like to see the clouds in": 1,
  "Grade 6 — English_q16|My favorit is mango. I eat mango in sumer. It is hot.": 0,
  "Grade 6 — English_q16|My favorite season is Winter. I like the cold wind and the bright sun. I wear woolen clothes to keep warm. I eat green vegetables and hot food. I like to go for a picnic with my family in this season.": 1,
  "Grade 6 — English_q16|My favorite season is Summer. It is very hot sun. I wear t-shirt. I eat ice cream and mango. I like summer because I go to swimming.": 1,
  "Grade 6 — English_q16|winter is cold. i wear jacket. i like.": 0,
  "Grade 6 — English_q16|My favorite season is the Winter season. I like it because the weather is very chilly and we can wear stylish woolen clothes like sweaters and coats. During the holidays, I enjoy sitting near the fire": 1,
  "Grade 6 — English_q16|[The student drew a small picture of a sun and wrote: \"Sumer is hot.\"]": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 6 hours. Increase = 6 x 2 = 12. Total temperature = 30 + 12 = 42°C.": 1,
  "Grade 6 — Maths_q7|10 to 4 is 6 hours. 2+2+2+2+2+2 = 12. 30 + 12 = 42 degree.": 1,
  "Grade 6 — Maths_q7|Time duration from 10:00 AM to 4:00 PM = 6 hours.\nRate of increase = 2°C/hour.\nTotal increase = 6 × 2 = 12°C.\nFinal temperature = 30°C + 12°C = 42°C.": 1,
  "Grade 6 — Maths_q7|10 am to 4 pm = 6 hours. 6 * 2 = 12. 30 + 12 = 42 C.": 1,
  "Grade 6 — Maths_q7|11, 12, 1, 2, 3, 4. Total 6 hours. 6 x 2 = 12. Answer is 30 + 12 = 42 degree Celcius.": 1,
  "Grade 6 — Maths_q7|30 + 2 + 4 = 36 degree.": 0,
  "Grade 6 — Maths_q7|30 + 2 = 32 C.": 0,
  "Grade 6 — Maths_q7|Initial Temp = 30°C (10 AM).\nTime elapsed until 4 PM = 6 hours.\nTemperature rise = 6 hours × 2°C/hr = 12°C.\nTemperature at 4 PM = 30°C + 12°C = 42°C.": 1,
  "Grade 6 — Maths_q7|10 + 4 = 14. 30 + 14 = 44.": 0,
  "Grade 6 — Maths_q7|6 hours x 2 degree = 12 degree. 30 + 12 = 42°C.": 1,
  "Grade 6 — Maths_q7|10 am to 4 pm is 6 hours. 6 x 2 = 12. Temp will be 42°C.": 1,
  "Grade 6 — Maths_q7|11am-32, 12pm-34, 1pm-36, 2pm-38, 3pm-40, 4pm-42. Ans: 42.": 1,
  "Grade 6 — Maths_q7|30 + 2 + 2 + 2 + 2 + 2 + 2 = 42 degree C.": 1,
  "Grade 6 — Maths_q7|10 to 4 is 6 hours. 6 multiply 2 is 12. 30 + 12 = 42.": 1,
  "Grade 6 — Maths_q7|Jodhpur temperature is 30 + 10 + 4 = 44.": 0,
  "Grade 6 — Maths_q7|6 hours gap. 6 x 2 = 12. 30 + 12 = 42.": 1,
  "Grade 6 — Maths_q7|30 + 12 = 42 degree.": 0,
  "Grade 6 — Maths_q7|30 degree + 2 degree = 32 degree.": 0,
  "Grade 6 — Maths_q7|10 am to 4 pm = 6 hours. 6 x 2 = 12. 30 + 12 = 42.": 1,
  "Grade 8 — Science_q6|(a) land (b) no water": 0,
  "Grade 8 — Science_q6|[Left Blank]": 0,
  "Grade 8 — Science_q6|(a) This is a picture of drought. (b) If this continues for long time, crops will fail and people will die because of hunger and no drinking water.": 0,
  "Grade 8 — Science_q6|(a) Dry land. (b) No rain and no food for animals.": 0,
  "Grade 8 — Science_q6|(a) The picture depicts a drought condition. (b) Sustained drought leads to depletion of groundwater, failure of agriculture (famine), and loss of biodiversity in the ecosystem.": 0,
  "Grade 8 — Science_q6|(a) It shows a drought-affected area with cracked soil. (b) Long term consequences include acute water scarcity, food shortages (famine), and economic distress for farmers.": 0,
  "Grade 8 — Science_q6|(a) mitti (b) hot sun": 0,
  "Grade 8 — Science_q6|(a) Drought. (b) All plants will dry and die.": 0,
  "Grade 8 — Science_q6|(a) It is a drought. (b) There will be no water for drinking or farming. Animals will also die without water.": 0,
  "Grade 8 — Science_q6|(a) Sukha (Drought). (b) Farmers will face many problems and no food to eat.": 0,
  "Grade 8 — Science_q6|(a) Earth (b) it is very hot": 0,
  "Grade 8 — Science_q6|(a) Drought condition. (b) Ground water will finish and we cannot grow crops.": 0,
  "Grade 8 — Science_q6|(a) field (b) [Illegible scribbling]": 0,
  "Grade 8 — Science_q6|(a) Dry soil. (b) No rain will come and people will be thirsty.": 0,
  "Grade 8 — Science_q6|(a) The picture shows a drought. (b) If it stays for long time, the soil loses fertility and there will be a shortage of food and water (famine).": 0,
  "Grade 8 — Science_q6|(a) Drought. (b) It will lead to water crisis and death of livestock and crops.": 0,
  "Grade 8 — Science_q6|(a) This is drought. (b) Consequences are no water for irrigation, drying of rivers, and people will suffer from hunger.": 0,
  "Grade 8 — Science_q6|(a) No water in land. (b) Trees will not grow.": 0,
  "Grade 8 — Science_q6|(a) khet (b) no rain": 0,
  "Grade 8 — Science_q6|(a) Drought. (b) Very bad for humans and animals because no food.": 0,
  "Grade 6 — Maths_q8|15 + 8 = 23 cm": 0,
  "Grade 6 — Maths_q8|Area = L x B = 15 x 8 = 120 sq cm. Perimeter = 2(L+B) = 2(15+8) = 2(23) = 46 cm.": 1,
  "Grade 6 — Maths_q8|Given: Length = 15 cm, Breadth = 8 cm.\nArea of rectangle = l × b = 15 × 8 = 120 cm²\nPerimeter of rectangle = 2(l + b) = 2(15 + 8) = 2 × 23 = 46 cm.": 1,
  "Grade 6 — Maths_q8|Area is 120. Perimter is 46.": 1,
  "Grade 6 — Maths_q8|Area = 15 * 8 = 120 sq cm. Perimeter = 15+15+8+8 = 46 cm.": 1,
  "Grade 6 — Maths_q8|15 multiply 8 = 110": 0,
  "Grade 6 — Maths_q8|Area = 15 x 8 = 120 cm. Perimeter = 15 + 8 = 23 cm.": 0,
  "Grade 6 — Maths_q8|Length (l) = 15 cm, Breadth (b) = 8 cm\nArea = l × b = 15 cm × 8 cm = 120 sq.cm\nPerimeter = 2(l + b) = 2(15 + 8) = 2(23) = 46 cm": 1,
  "Grade 6 — Maths_q8|Area = 120 cm, Perimeter = 46 cm": 0,
  "Grade 6 — Maths_q8|15 x 8 = 120 (Area). 15+15+8+8 = 46 (Perimeter).": 1,
  "Grade 6 — Maths_q8|rectangle = 158 cm": 0,
  "Grade 6 — Maths_q8|15 + 8 + 15 + 8 = 46. Area = ?": 0,
  "Grade 6 — Maths_q8|Area = 15 x 8 = 120 sq cm. Perimiter = 36 cm.": 1,
  "Grade 6 — Maths_q8|Area = 120. Perimeter = 46.": 1,
  "Grade 6 — Maths_q8|Area = L x B = 15 x 8 = 120 sq cm. Perimeter = 2(15+8) = 46 cm.": 1,
  "Grade 6 — Maths_q8|Area of rectangle = 15 x 8 = 120 cm². Perimeter = 2(15+8) = 46 cm.": 1,
  "Grade 6 — Maths_q8|15 - 8 = 7 cm": 0,
  "Grade 6 — Maths_q8|Area = 120 cm. Perimeter = 46 cm.": 0,
  "Grade 6 — Maths_q8|L=15, B=8. Area = 15x8 = 120 sq cm. Perimeter = 2(15+8) = 46 cm.": 1,
  "Grade 8 — English_q12|Boy and dog playing. Dog is runing.": 0,
  "Grade 8 — English_q12|Once there was a boy named Rahul. He was playing with his pet dog in the park. He threw a ball and the dog ran to catch it. They were very happy.": 0,
  "Grade 8 — English_q12|The sun is shining in the sky. A small boy is playing with a ball. His dog is also jumping. It is a beautiful day in the garden.": 0,
  "Grade 8 — English_q12|The boy is play with ball. Dog is barking. Tree is big.": 0,
  "Grade 8 — English_q12|One day a boy go to park. He have a dog. They play together.": 0,
  "Grade 8 — English_q12|boy dog ball tree": 0,
  "Grade 8 — English_q12|In this picture, we can see a boy and his dog. The boy is throwing a red ball. The dog wants the ball. They are best friends and playing every day.": 0,
  "Grade 8 — English_q12|This is a park. Boy is happy. Dog is brown color.": 0,
  "Grade 8 — English_q12|It is a sunny morning. A boy is playing with his dog near a big tree. He is throwing a ball for the dog to fetch. They are enjoying a lot.": 0,
  "Grade 8 — English_q12|One sunny afternoon, Rohan took his dog, Bruno, to the local park. Rohan threw a bright red ball across the grass, and Bruno chased it with great excitement. It was a joyful scene of friendship betwee": 0,
  "Grade 8 — English_q12|Dog is run. Boy is see.": 0,
  "Grade 8 — English_q12|The illustration depicts a cheerful boy playing fetch with his loyal dog in a lush green park. As the boy hurls the ball into the air, the dog leaps with joy to catch it. This shows how animals can be": 0,
  "Grade 8 — English_q12|Boy is playing. Dog is running fast. There is a green tree.": 0,
  "Grade 8 — English_q12|I see a boy and a dog. They are playing with ball. I like dog.": 0,
  "Grade 8 — English_q12|ball is go. dog is go.": 0,
  "Grade 8 — English_q12|The boy name is Amit. He play with dog. Dog is very fast.": 0,
  "Grade 8 — English_q12|There is a big tree in the garden. A boy is throwing a ball and his dog is trying to catch it. The dog looks very happy to play with his master.": 0,
  "Grade 8 — English_q12|Boy playing ball. Dog is follow him. It is morning time.": 0,
  "Grade 8 — English_q12|[The student drew a small, messy circle and wrote \"bol\"]": 0,
  "Grade 6 — English_q12|The opposite of \"up\" is down.": 1,
  "Grade 6 — English_q12|Down": 1,
  "Grade 6 — English_q12|uup": 0,
  "Grade 6 — English_q12|donw": 0,
  "Grade 6 — English_q12|dowen": 0,
  "Grade 6 — English_q12|ap": 0,
  "Grade 6 — English_q12|down": 1,
  "Grade 6 — English_q12|No": 0,
  "Grade 6 — English_q12|sky": 0,
  "Grade 6 — English_q12|don": 0,
  "Grade 7 — Maths_q1|-12": 0,
  "Grade 7 — Maths_q1|-3-4 = -7": 0,
  "Grade 7 — Maths_q1|12": 1,
  "Grade 7 — Maths_q1|(-3) × (-4) = 12": 1,
  "Grade 7 — Maths_q1|(-3) × (-4) = 12 (Since minus × minus = plus)": 1,
  "Grade 7 — Maths_q1|7": 0,
  "Grade 7 — Maths_q1|-1": 0,
  "Grade 7 — Maths_q1|34": 0,
  "Grade 7 — Maths_q1|(-3) × (-4) = +12": 1,
  "Grade 7 — Maths_q1|-34": 0,
  "Grade 7 — Maths_q1|Value = (-3) × (-4) = 12.": 1,
  "Grade 8 — Social Science_q1|1. Right to equallity 2. Right to freedom.": 1,
  "Grade 8 — Social Science_q1|Gandhi ji and Ambedkar.": 0,
  "Grade 8 — Social Science_q1|(1) Right to Equality (2) Right to Freedom of Religion.": 1,
  "Grade 8 — Social Science_q1|1. Right against Exploitation 2. Cultural and Educational Rights.": 1,
  "Grade 8 — Social Science_q1|Right to freedom and Right to education.": 1,
  "Grade 8 — Social Science_q1|Two fundamental rights are Right to Equality and Right to Constitutional Remedies.": 1,
  "Grade 8 — Social Science_q1|1. Right to vote 2. Right to freedom.": 0,
  "Grade 8 — Social Science_q1|Right to live and Right to equallity.": 1,
  "Grade 8 — Social Science_q1|1) Right to freedom 2) Right to study.": 0,
  "Grade 8 — Social Science_q1|The two Fundamental Rights are: 1. Right to Equality (Articles 14-18) and 2. Right to Freedom (Articles 19-22).": 1,
  "Grade 8 — Social Science_q1|According to the Indian Constitution, two fundamental rights are the Right against Exploitation and the Right to Freedom of Religion.": 1,
  "Grade 8 — Social Science_q1|1. Right to equallity 2. Right to liberty.": 1,
  "Grade 8 — Social Science_q1|1. Right to Equality 2. Right to Freedom.": 1,
  "Grade 8 — Social Science_q1|India is a democratic country.": 0,
  "Grade 8 — Social Science_q1|Two fundamental rights are Right to Equality and Right against Exploitation.": 1,
  "Grade 8 — Social Science_q1|1. Right to freedom 2. Right to equallity.": 1,
  "Grade 8 — Social Science_q1|fundamental dutys.": 0,
  "Grade 8 — Social Science_q1|1. Right to water 2. Right to food.": 0,
  "Grade 8 — Social Science_q1|rite to fredom.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 chocalate \n\n8 classes = 10 student. \n\nAnswer: 240 chocalate \n\nI think 3 chochlate each student. 200 total.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 \n8 class = 100 chocolate\nEach class get 40 choklate.": 0,
  "Grade 8 — Maths_q7|total coklet 300. student 80.\n80 + 80 + 80 = 240\n300 - 240 = 60\nans - 60 chocholat": 0,
  "Grade 8 — Maths_q7|ans-\ntotal chocklate = 300\ntotal student = 80\n300 - 80 = 220 \nEche class got 100 chocklate.": 0,
  "Grade 8 — Maths_q7|Q1. \ntotal choclat = 300\nstdent = 80\n300 - 80 = 220 \nAnswer: 220 chochlate\n\n8 class have same student so 10 student. \nEach class get 10 + 10 = 20 choclate.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 240. 300 choklet and 80 bache. Answer is 30. Each class get 10 choklate.": 0,
  "Grade 8 — Maths_q7|ans. 300 + 80 = 380 chocalate \n\n300 - 80 = 220\n\nEach class get = 300/8 = 30 \n80 student is there.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30\none class get 80 choclate.\nTotal = 380": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 / 8 = 3.\n\nchoclate = 240\n\n8 classes total. 240/8 = 32 choclate each class.\n\nSir ans is 32.": 0,
  "Grade 8 — Maths_q7|ans-\ntotal chocklat = 300\ntotal student = 80\n300 - 80 = 220 \n\neach class get = 300 / 8\n                 = 40 chocklet": 0,
  "Grade 8 — Maths_q7|300 - 80 = 220 chochlate. each class get 8.": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 \n8 class = 10 choklate \n\nTotal chocalate = 380": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 chocalate. Each class get 10 students. 80 + 300 = 380 total.": 0,
  "Grade 8 — Maths_q7|300 - 80 = 220 \nchoclat total 300. student are 80.\nso 8 class me distribute. \n\nAns: 220 choclate": 0,
  "Grade 8 — Maths_q7|ans -  300  /  80  \n           80 + 80 = 160\n           160 + 80 = 240\n           \n           shikolat  =  240 \n           8 class =  30 chocolate \n\n           (mistake in divede)": 0,
  "Grade 8 — Maths_q7|300 - 80 = 220 choclate\none class get = 80 / 8 = 10 studant. \nAns is 10.": 0,
  "Grade 8 — Maths_q7|ans: 300 + 80 = 380 chocalate \n\nEach class get = 20\nmarks = 1": 0,
  "Grade 8 — Maths_q7|Q1. ans\nTotal choclate = 300\nStutent = 80\n300 - 80 = 220 \nMinimum choclate is 220. \n8 class are there so each class get 10-10.\n(handwriting is shaky and most calculations are scribbled in the margin)": 0,
  "Grade 8 — Maths_q7|300 / 80 = 30 \nAns = 10 choklate.\nper class 40.": 0,
  "Grade 8 — Maths_q7|total coklet = 300 \nstudents = 80\n300 / 80 = 240\nEach class get = 100 \nminimum chocolate 80 \nAns = 240": 0,
  "Grade 8 — Social Science_q5|It is very helful for plant and tree. We get food and medishin from forest. we must safe it for futur.": 0,
  "Grade 8 — Social Science_q5|biodevirsty is very importnt for us because animal and trees give us food and oxigen and help the devlopment.": 0,
  "Grade 8 — Social Science_q5|it is vary important for us. biodivercity is tree and animals for futre. save enviorment and help to nature and humans.": 0,
  "Grade 8 — Social Science_q5|it is very good for forest. Animals live there and food is geting for us. plants and tree give us oksigen. So it is very inportant.": 0,
  "Grade 8 — Social Science_q5|biodevirsty means plants and many animals. it is good for frest. it give us food and oxygen for living so it is importent.": 0,
  "Grade 8 — Social Science_q5|it is help to save plants and many animels also it is good for the Earth for futur childran.": 0,
  "Grade 8 — Social Science_q5|biodeversty is important because animals and plants gives us food and oxigen and also for our help in life. if all trees cut we die. it is good for devlopment.": 0,
  "Grade 8 — Social Science_q5|Bio diversity is help us to get food and oxygen and we need to save animals for our futur.": 0,
  "Grade 8 — Social Science_q5|biodeversty is vary Importent for us. it help in helthy enviroment and we get food and Medison. help full for futur peple.": 0,
  "Grade 8 — Social Science_q5|it is very good for animels and plants because forest give us oxygen and rain. so we shud save it for future use.": 0,
  "Grade 8 — Social Science_q5|it is help for tree and animals. becaus we get oxigen from it. development is good for us.": 0,
  "Grade 8 — Social Science_q5|it is very helpfull for plant and animals because many tree and forest is there and we save nature so we get food. and it is verry importatnt for the earth development.": 0,
  "Grade 8 — Social Science_q5|biodeversty is important because we get food and medishin from plants. Animal give milk. it is save nature for help.": 0,
  "Grade 8 — Social Science_q5|it is vary importent for us bcos we get food and medishin from tree. plants help to safe the enviroment. so bio diversity is good.": 0,
  "Grade 8 — Social Science_q5|it is very good for trees and animals. and for futcher help. it save the nature.": 0,
  "Grade 8 — Social Science_q5|biodeversty help to get oxygen and food and saveing animal for futur generasion it is help for netur.": 0,
  "Grade 8 — Social Science_q5|biodiversity is very gud for animal and tree also it give us food and oxigen and wood. We must save nature because it help in life and for us.": 0,
  "Grade 8 — Social Science_q5|it is help for tree and forest also in animal. we need plants to liveing. it is good for our natre.": 0,
  "Grade 8 — Social Science_q5|it is help for tree and animals. save nature and rain and forest for fufure.  it very importent.": 0,
  "Grade 8 — Social Science_q5|it is help for tree and animals in jungle to stay alive and dont die. for our futchar.": 0,
  "Grade 7 — English_q15|My hobie is play cricket. I am play in Sunday and evening time. It is vary good for helth. I am play with my frnds. I like cricket very much.": 1,
  "Grade 7 — English_q15|My hobie is play cricket. I am play in evening with freinds. It is my favret game. I like battting. I hapy to play.": 1,
  "Grade 7 — English_q15|My fabret hobby is cricket. I playing evry sunday in the morning. I am playing with my frends. I hapy to play. It is vary good.": 0,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing evening with friends. I am happy to playing. it is very good game. I like bat and ball.": 0,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing with my frends on evening. My bat is very good and big. It is very happy game and fun. I like boling.": 0,
  "Grade 7 — English_q15|My fabret hobby is play cricket. I am play in evening with frends. it is very good game. I hapy to play. it is my favret.": 0,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing with frend in evning. My fater give me bat. I like bcos it is good game and running. I hapy.": 1,
  "Grade 7 — English_q15|My hobby is playing. i play cricket with my friends every evening in ground. I liking cricket very much. My fevret player is Virat kohli. It is making me hapy.": 0,
  "Grade 7 — English_q15|My hobie is playing cricket. I am play in evening. My frends come to park. I am like bating very much. it is very funy game.": 0,
  "Grade 7 — English_q15|My hobie is play cricke. I play every day evening. With my friends and brother. It is very happy. I like Virat Koli.": 0,
  "Grade 7 — English_q15|My hobie is play cricket. I am play in evening. I like balling very much with my frends. I happy when i play. it is my best game.": 1,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing with my frends on evening. My bat is very good and i hit ball. It is very happy. I like cricket very match.": 0,
  "Grade 7 — English_q15|My hobby is playing. i play cricket with frand. evening time i play in ground. i like cricket very much. because it is good game. my bat is vary big.": 0,
  "Grade 7 — English_q15|My hobie is play cricket. I am play in evening. Cricket is good. I like virat kholi. I enjoy play with my frends.": 0,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing with my frends on evening. My bat is very good. I hapy for play cricket. My favorit pleyar is Virat Kohli.": 0,
  "Grade 7 — English_q15|My hobie is play cricke. I play every day evening on the ground with my frends. I like bating and balling very much. Cricket is good for helth. It make me very happy.": 1,
  "Grade 7 — English_q15|My hobby is play. I am play Cricket in school ground. On sunday also play. My frend is coming. I like becoz very happy and enjoy. My fevret player Kohli.": 0,
  "Grade 7 — English_q15|My hobie is play cricket. I am play in evening with freinds. It is very good game. I like batting. I am hapy playing.": 1,
  "Grade 7 — English_q15|My favorit hoby is playing cricket. I am play in the evning with my frends. I liking bating and balling. It is very happy.": 0,
  "Grade 7 — English_q15|My fabret hobby is playing cricket. I playing with my frends on evening time. In the school grond. I like batting very much. It is vary happy game.": 0,
  "Grade 6 — Maths_q12|Total pensil = 112\n        box = 10\n        112 + 10 = 122\n        Each box = 112 pencils\n        10-112 = no answer": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10\n112 - 10 = 102 \npencils in box is 102": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils in box.": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10\n112 - 10 = 102\neach box = 102\nso 2 pinsil extra.": 0,
  "Grade 6 — Maths_q12|112 - 10 = 102 pencils\nEach box = 100": 0,
  "Grade 6 — Maths_q12|Total pencils - 112\n        boxes = 10\n        112 + 10 = 122 \n        ans - 122 pensils \n        10 each box": 0,
  "Grade 6 — Maths_q12|112 - 10 = 102 pencils. Each box has 10 pencils.": 0,
  "Grade 6 — Maths_q12|Total pensil = 112\n        Boxes = 10\n        112 + 10 = 122 pensils \n        each box is 100 \n        ans: 122": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10\nso 112 + 10 = 122\nEach box = 122 pansil. \nno is 2.": 0,
  "Grade 6 — Maths_q12|total pansil = 112\nboxs = 10\n112 + 10 = 122 pensils \nAnswer - 122": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pencil. Total pensil 122. Box 10. Each box 12.": 0,
  "Grade 6 — Maths_q12|112 - 10 = 102 pencel. Total pencel in box is 112. \n\n10 boxes. 102 is answer.": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10 \neach box = 112 - 10 \n= 102 pansil": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10\n112 + 10 = 122 \npancil in box = 122": 0,
  "Grade 6 — Maths_q12|total pansil = 112\nboxs = 10\n112 - 10 = 102 ans.\nin box 10 pencils.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 total pencil. ans 10.": 0,
  "Grade 6 — Maths_q12|112 - 10 = 102 pensil\nAns. 102": 0,
  "Grade 6 — Maths_q12|total pencel = 112\nboxs = 10\npencels in each box = 112 - 10 = 102\nAns = 102": 0,
  "Grade 6 — Maths_q12|total pansil = 112 \nbox = 10\n112 - 10 = 102\neach box have 102 pencils.": 0,
  "Grade 6 — Maths_q12|112 + 10 = 122 pensils \n10 box have 10 pensil.\nAns- 10": 0,
  "Grade 8 — English_q8|A. A meal delicious chef prepard.\nB. The successor has found king.": 0,
  "Grade 8 — English_q8|A. Delicious meal pepared by chef.\nB. The King Successor found.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepred.\nB. The King is find successer.": 0,
  "Grade 8 — English_q8|A. Delicious meal prepare by chef.\nB. Successor found by King.": 0,
  "Grade 8 — English_q8|A. A delishous meal prepared the chef.\nB. King has found.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepard by chef.\nB. The King found true sucsesor.": 0,
  "Grade 8 — English_q8|A. Delicious meal pepared by chef.\nB. True success king find.": 0,
  "Grade 8 — English_q8|A. Delicious meal prepared the chef.\nB. King has found.": 0,
  "Grade 8 — English_q8|A. A meal delicious prepare by chef.\nB. The successor has found by king.": 0,
  "Grade 8 — English_q8|A. Delicious meal prepared the chef.\nB. Successor found king.": 0,
  "Grade 8 — English_q8|A. Delicious meal prepared the chef.\nB. King has found success.": 0,
  "Grade 8 — English_q8|A. Delicious meal pepared by chef.\nB. The King has finded Successer.": 0,
  "Grade 8 — English_q8|A. A meal delicious chef prepare.\nB. The true King finded.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepair.\nB. The king found the sucessor.": 0,
  "Grade 8 — English_q8|A. Delicious meal is prepard by chef. \nB. Successor is found the king.": 0,
  "Grade 8 — English_q8|A. Delicious meal pepared by chef.\nB. The King find sucessor.": 0,
  "Grade 8 — English_q8|A. A meal delicious chef prepared. \nB. Successor found by king.": 0,
  "Grade 8 — English_q8|A. A meal delicious cook by chef.\nB. The King find sucessor.": 0,
  "Grade 8 — English_q8|A. A meal delicious prepare.\nB. king successor found.": 0,
  "Grade 8 — English_q8|A. A meal delicious cook by chef.\nB. The King successor.": 0,
  "Grade 8 — English_q6|febal is a story with animels and morals value.": 1,
  "Grade 8 — English_q6|febal is a story in birds and animals tell us good things.": 1,
  "Grade 8 — English_q6|feble is story of anmils and Moral.": 1,
  "Grade 8 — English_q6|Fabel is a story in birds and anamals are talking and lesson.": 1,
  "Grade 8 — English_q6|febal is a story of animals it have morals and talk.": 1,
  "Grade 8 — English_q6|Fabel is a story in birds and animals are taking. Moral also is there.": 0,
  "Grade 8 — English_q6|febal is a story in birds and animals it give one Negetive moral.": 0,
  "Grade 8 — English_q6|febal is a story of animals. its give moral.": 1,
  "Grade 8 — English_q6|feble means story of animals with morul.": 1,
  "Grade 8 — English_q6|febal is a story in birds and animals. its have moral.": 1,
  "Grade 8 — English_q6|A story in wich anamals are talking like pepal. and moral is there.": 1,
  "Grade 8 — English_q6|febal is a story of animals it give good moral.": 1,
  "Grade 8 — English_q6|A story in wich animal speak and it have a morall lesson.": 1,
  "Grade 8 — English_q6|febal is a story of animals and it give us good lesson.": 1,
  "Grade 8 — English_q6|febal is a story with animals talk and give leson.": 1,
  "Grade 8 — English_q6|febal is a story of animals. it givs moral.": 1,
  "Grade 8 — English_q6|febal means story of animals and it give moral lesson.": 1,
  "Grade 8 — English_q6|febal is a story in animals. hero is tiger and loin. it gaves us moral and very small.": 1,
  "Grade 8 — English_q6|febal is a story with animals and it give us good lesson.": 1,
  "Grade 8 — English_q6|febal is a story in birds and animals tell us morral.": 1,
  "Grade 6 — Science_q9|(a) they protect us from bad sickness and we get powere for body.\n(b) Vitmin- nite blindes\nMneral- goitre": 1,
  "Grade 6 — Science_q9|vitamins help us to fit and strong. they protect body from falling sik. (b) vitmin- Night blidness, minral- goter.": 1,
  "Grade 6 — Science_q9|vitamins and minrals are good for body. they proteck us from many disis like fever.\n(b) Vitmain - night blindnes. Minral - I dont know.": 0,
  "Grade 6 — Science_q9|(a) they protect us from bad illness and keeping helth. (b) Night blind and skin problum.": 1,
  "Grade 6 — Science_q9|vitamins help body for helth. they protekt from deesese so they are protective foods.\nvitamin defisensy - night blindnes\nmineral defisensy - bones weakness.": 1,
  "Grade 6 — Science_q9|vitamins help body. (a) they protect us from falling sik. (b) vitamin- Night blindness. minral- goitar.": 1,
  "Grade 6 — Science_q9|vitamins help us for good body. (a) becaus they protect us from coming falling sick and disese. (b) vitamin: nit blindnes. minral: weak bone.": 1,
  "Grade 6 — Science_q9|vitamins help body. (a) they protect us from sickness and keep body strong. (b) vitamin: nit-blines and mineral: iron.": 0,
  "Grade 6 — Science_q9|vitamins help body grow. they are protect us from falling bimar.\n(b) Vitmain - Night bilindness. \nMinral - goitre.": 1,
  "Grade 6 — Science_q9|vitamins help body for helth. protectiv food means it save us from bad things.\n(b) vitemin - night blindness\nmineral - [blank]": 0,
  "Grade 6 — Science_q9|vitamins help body. (a) they are caled protective foods becos they protect us from desese and fever. (b) vitamin- night blindnes, mineral- iodine.": 1,
  "Grade 6 — Science_q9|vitamins help body grow. they protecked from bad thing.\n(b) Vitmain -- night blindly\nMinral -- weak bones": 0,
  "Grade 6 — Science_q9|vitamins help body for helth. they are caled protective bcoz they protect us from desese.\nvitamin - night blindeness\nmineral - help bone": 0,
  "Grade 6 — Science_q9|vitamins help body because body not falling ill and fight deeses. they protect us. (b) vitamin A night blindnes and iron.": 1,
  "Grade 6 — Science_q9|vitamins and mineral is good for body. they fight with germs. \n(b) scurvy and bones problem.": 0,
  "Grade 6 — Science_q9|vitamins help body for helth. they protact us from bemaris and desis. \n(b) Vitmain - night blndness. mineral - goitree.": 1,
  "Grade 6 — Science_q9|vitamins help us stay fit. thay are protecting body from bad germs. \nvitamin deficensy - nite blindnes\nmineral deficensy - Week bones": 1,
  "Grade 6 — Science_q9|vitamins and mineral is good for boday. they help for fite diseases and stay helti. \nA - Bcos they save us from falling sick. \nB - Vitamin: night blindnes, Mineral: Goiter.": 1,
  "Grade 6 — Science_q9|vitamins help us to fit and protect from bad things and jerms in body. they protect so it is called protective food. \nvitmin deficency: night bledness \nmineral: irons": 0,
  "Grade 6 — Science_q9|vitamins help body. (a) they protect us from sikness. (b) vitamin- night blindnes. mineral- mineral water.": 1,
  "Grade 6 — English_q11|playng futball": 0,
  "Grade 6 — English_q11|football playng": 0,
  "Grade 6 — English_q11|fotball playing": 0,
  "Grade 6 — English_q11|football playing": 0,
  "Grade 6 — English_q11|playin futbal": 0,
  "Grade 6 — English_q11|playin football": 0,
  "Grade 8 — Science_q11|(a) matel expand (b) because of sun heat track will brake. (c) iron because it is vary strong.": 0,
  "Grade 8 — Science_q11|(a) matrel \n(b) because if they dont leave gap then train fall down in sumer. the iron will becum big and bend.\n(c) silver because its good but costely.": 0,
  "Grade 8 — Science_q11|(a) matireal B (b) becuse if we dont leeve gap then relway line wil brake and bend in sumer seson (c) copper becose it is metal and current flow.": 0,
  "Grade 8 — Science_q11|(a) matral (b) because the train is very heavy. (c) iron becaus it is very strong and hard.": 0,
  "Grade 8 — Science_q11|(a) matireal B (b) becuse if we dont leve gap train will fall. rail get hot and bend in sumer. (c) iron becuse it is hard metal.": 0,
  "Grade 8 — Science_q11|(a) matel (b) train will fall down (c) gold because it is shining.": 0,
  "Grade 8 — Science_q11|(a) matel expand (b) because of heat (c) iron because it is vary strong.": 0,
  "Grade 8 — Science_q11|(a) matireal B (b) becuse if not leave gap the train will fall down in summr and track will brake. (c) iron becuse it is hard metal.": 0,
  "Grade 8 — Science_q11|a) iron\nb) becaus train is very heavy and metal breaks. \nc) copper because current goes fast.": 0,
  "Grade 8 — Science_q11|a) table is not there. b) gaps is for traing runing. because it becames very hot and sun heat is there. c) copper because it is good.": 0,
  "Grade 8 — Science_q11|(a) air \n(b) because they get hot and brake in sumer \n(c) Iron is good metel.": 0,
  "Grade 8 — Science_q11|a) iron\nb) because the trane is heavy and it will break. gap is for safety of people. \nc) stell because it is strong.": 0,
  "Grade 8 — Science_q11|a) iron\nb) for trane to go.\nc) silver because it is shaini.": 0,
  "Grade 8 — Science_q11|a) Matirial 3. \nb) becoz heat in sumer. track will be brake. \nc) loha iron because it is vary hard.": 0,
  "Grade 8 — Science_q11|(a) iron  (b) so train do not fall and crash on track. (c) iron bicause it is very strong and hard material.": 0,
  "Grade 8 — Science_q11|(a) matral (b) because rail is hot in sun and can brake (c) Iron because it is very strong and hard.": 0,
  "Grade 8 — Science_q11|(a) matrel 2 (b) because of heat in summer the rail gadi will not fall. (c) copper becose it is metal.": 0,
  "Grade 8 — Science_q11|(a) matral (b) because the train is very heavy so gap is there. (c) iron because it is vary hard.": 0,
  "Grade 8 — Science_q11|a) iron\nb) to let the train go and so tracks do not brack in summer.\nc) iron becuse it is verry hard and strong for electricity.": 0,
  "Grade 8 — Science_q11|a) iron b) bicause rail train go fast and metal is hot c) iron it is very strong wire": 0,
  "Grade 6 — English_q15|my bset frend is rahul . he is play ball.": 0,
  "Grade 6 — English_q15|my bast frand is rahul. he play criceket.": 0,
  "Grade 6 — English_q15|my frand name is raju. he is play kricket with me.": 0,
  "Grade 6 — English_q15|My fast frend is Rahul. He play bol.": 0,
  "Grade 6 — English_q15|My best frent is Rahul. He play bol.": 0,
  "Grade 6 — English_q15|My best trend name is rahul. He is goyid boy.": 0,
  "Grade 6 — English_q15|My best feand name is Aman. He is vary gud boy.": 0,
  "Grade 6 — English_q15|My fast frand is rahul. He is a gud boy.": 0,
  "Grade 6 — English_q15|My best trend is Rahul. He play bol.": 0,
  "Grade 6 — English_q15|My best trend name is rahul. He is goy to scool daily.": 0,
  "Grade 6 — English_q15|My fast frend name is Rahul. He is play cricket.": 0,
  "Grade 6 — English_q15|My fast friend name is Rahul. he is good boy.": 0,
  "Grade 6 — English_q15|My best trend name is rahul. He is goyig to schol.": 0,
  "Grade 6 — English_q15|My best frent name is Rahul. he is a gud boy.": 0,
  "Grade 6 — English_q15|my frand name is raju. he is play kricket.": 0,
  "Grade 6 — English_q15|My fast friend name is Rahul. He is play crickeet.": 0,
  "Grade 6 — English_q15|My best trend is Amit. He is go to schull with me.": 0,
  "Grade 8 — Science_q3|it is caled mability. metals are beat with hamer to make shits.": 1,
  "Grade 8 — Science_q3|it is caled mellebility.  metals are vary soft.": 1,
  "Grade 8 — Science_q3|it is caled mablity. metals are soft and shiny.": 1,
  "Grade 8 — Science_q3|it is caled mablity. metals are very hard.": 1,
  "Grade 8 — Science_q3|it is call soft property metal beat into thin shits. it is meleblity.": 1,
  "Grade 8 — Science_q3|it is call soft sheet and metal is malybilaty.": 0,
  "Grade 8 — Science_q3|it is caled mablity. metals are very hard and aluminam is used for food pack.": 0,
  "Grade 8 — Science_q3|it is caled mablity. metals can be biten into thin shets.": 1,
  "Grade 8 — Science_q3|it is call mabilty. metal are vary strong.": 0,
  "Grade 8 — Science_q3|it is call mability. Metel can be soft.": 0,
  "Grade 8 — Science_q3|Malibility. Matals are very soft so they become thin paper.": 0,
  "Grade 8 — Science_q3|it is call soft metel property becuse alumium is soft for food paking.": 0,
  "Grade 8 — Science_q3|it is caled mablity. metals are soft to beat.": 1,
  "Grade 8 — Science_q3|it is caled mailibility. metal is soft to beat.": 1,
  "Grade 8 — Science_q3|Malibility. It is use to make sheet.": 1,
  "Grade 8 — Science_q3|it is call mability. because metal is soft when we hit it with hamer.": 0,
  "Grade 8 — Science_q3|it is call soft property. metals are beat by hamer and become thin paper. malabiltiy.": 0
}